var images = new Array("./images/img_1.jpg", "./images/img_2.jpg", "./images/img_3.jpg", "./images/img_4.jpg", "./images/img_5.jpg");
var names = new Array("Альберт Ейнштейн", "Ісаак Ньютон", "Стівен Гокінг", "Вільям Шекспір", "Вольфганг Амадей Моцарт");
var descriptions = new Array("Американський, німецький та швейцарський фізик-теоретик, один із найвизначніших науковців XX століття, творець теорії відносності та один із творців квантової механіки. Його формулу еквівалентності маси й енергії E = mc2, яка випливає зі спеціальної теорії відносності, вважають «найвідомішим рівнянням у світі». Лауреат Нобелівської премії з фізики (1921) за «заслуги в галузі теоретичної фізики, і зокрема за відкриття закону фотоелектричного ефекту».", "Англійський науковець, який заклав основи сучасного природознавства, творець класичної фізики. Він сформулював закони руху, відомі як закони Ньютона й закон всесвітнього тяжіння, які стали основою наукового світогляду впродовж трьох наступних століть і мали великий вплив не тільки на фізику, а й на філософію. Використовуючи свою теорію Ньютон зміг пояснити закони Кеплера, що описують рух планет навколо Сонця, чим заперечив останні сумніви щодо геліоцентричної системи світобудови.", "Англійський фізик-теоретик, космолог і автор багатьох книжок, директор з досліджень Центру Теоретичної Космології Кембриджського університету, відомий своїми дослідженнями в астрофізиці, зокрема теорії чорних дір та популяризації наукових знань. Обіймав посаду лукасівського професора математики між 1979 та 2009 роками.", "Англійський драматург, актор і поет. Один із найвідоміших драматургів світу, автор принаймні 17 комедій, 10 хронік, 11 трагедій, п'яти поем і циклу зі 154 сонетів. Шекспір визнаний найвидатнішим англійським драматургом усіх часів. Його вважають національним героєм та одним із символів Англії, її національним поетом. Твори перекладені багатьма мовами світу і з'являються на театральній сцені частіше, ніж п'єси будь-якого іншого драматурга, який коли-небудь жив і творив.", "Видатний австрійський композитор і музикант-віртуоз. Один з найпопулярніших класичних композиторів, Моцарт зробив великий вплив на світову музичну культуру. За свідченнями сучасників, Моцарт мав феноменальний музичний слух, пам'ять і неперевершену здатність до імпровізації.");
var counter = 0;

let next = document.querySelector("#next");
let previous = document.querySelector("#previous");

next.addEventListener("click", nextImage);
previous.addEventListener("click", previousImage);

function nextImage() {
    counter++;
    if (counter == images.length) {
        counter = 0;
    }
    document.images["image"].src = images[counter];
    document.images["image"].alt = names[counter];

    document.querySelector("#name").textContent = names[counter];
    document.querySelector("#description").textContent = descriptions[counter];
    return false;
}

function previousImage() {
    counter--;
    if (counter < 0) {
        counter = images.length - 1;
    }
    document.images["image"].src = images[counter];
    document.images["image"].alt = counter + 1;

    document.querySelector("#name").textContent = names[counter];
    document.querySelector("#description").textContent = descriptions[counter];
    return false;
}